04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p0_refined_LaunderSharmaKE/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(4e-08 0.001467 -3.04872e-26 4e-08 -0 4e-08)
(4e-08 0.00146702 -6.55058e-26 4e-08 -0 4e-08)
(4e-08 0.00146695 -5.143e-26 4e-08 -0 4e-08)
(4e-08 0.0014669 -3.61995e-26 4e-08 -0 4e-08)
(4e-08 0.00146685 -1.9098e-26 4e-08 -0 4e-08)
(4e-08 0.00146682 -1.20031e-26 4e-08 -0 4e-08)
(4e-08 0.00146678 5.4571e-27 4e-08 -0 4e-08)
(4e-08 0.00146676 -1.53643e-27 4e-08 -0 4e-08)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 -0 0 6.66667e-16 -0 6.66667e-16);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 0 -0 6.66667e-16 -0 6.66667e-16);
    }
}


// ************************************************************************* //
