04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p0_refined_LaunderSharmaKE/0/UDNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14751
(
(1.597599711345915659e-03 -1.096277154485121570e-07 3.626661525926550730e-06)
(1.601309124885186806e-03 -5.880052687207998880e-08 3.645598842016809490e-06)
(1.602325036278086801e-03 -9.929251115233551465e-09 3.651074255792304420e-06)
(1.600579650526554260e-03 3.327960235774228383e-08 3.645673762305471840e-06)
(1.596117532933238750e-03 9.525992722294041563e-08 3.651557832319974994e-06)
(1.588977634670945237e-03 1.984496144936817279e-07 3.689956884161708875e-06)
(1.579228496587262859e-03 3.042087364998284410e-07 3.756312479850326202e-06)
(1.567019766431358924e-03 4.076811833294852930e-07 3.832246807925870101e-06)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}